tutorials/combustion/dieselFoam/aachenBomb/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tdefault;
}
// ************************************************************************* //

dimensions          [ 0 0 0 0 0 0 0 ];

internalField       uniform 0;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
